In [1]:
# Import modules
from bs4 import BeautifulSoup
import requests
from splinter import Browser
from selenium import webdriver
import pandas as pd
import time
from secret import username, password
from sqlalchemy import create_engine
import csv
import numpy as np
import html5lib

### Mac (Irina) Connection

In [2]:
# https://splinter.readthedocs.io/en/latest/drivers/chrome.html
!which chromedriver

/usr/local/bin/chromedriver

In [3]:
executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
browser = Browser('chrome', **executable_path, headless=False)

### Windows (Clay) Connection

In [4]:
# executable_path = {'executable_path': 'C:/Users/Clay/chromedriver.exe'}
# browser = Browser('chrome', **executable_path, headless=False)

### Dataset 1 - Web Scrape Box Office Mojo

In [4]:
mojo_list = []
base_url = 'https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW'
page_num = 0
table_mojo_test_df = []

for i in range(0, 10000, 200):
    if page_num < 100:
        print("Printing first 200 rows.")
        url=(f"{base_url}")
        print(url)
##         Mac (Irina)
        executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
##         Windows (Clay)
#         executable_path = {'executable_path': 'C:/Users/Clay/chromedriver.exe'}
        browser = Browser('chrome', **executable_path, headless=False)
        browser.visit(url)
        time.sleep(3)
        print("Open web browser")
        tables = pd.read_html(url)
        time.sleep(3)
        table_mojo_df = tables[0] # Create table from the first page
        print("Read and save table")
        browser.quit()
        page_num += 200
        table_mojo_test_df = table_mojo_df
        print('-------------------------------------')
    else:
        print(f"Printing pages {i+1} to {i+200}")
        url=(f"{base_url}&offset={str(i)}")
        print(url)
##         Mac (Irina)
        executable_path = {'executable_path': '/usr/local/bin/chromedriver'}
##         Windows (Clay)
#         executable_path = {'executable_path': 'C:/Users/Clay/chromedriver.exe'}
        browser = Browser('chrome', **executable_path, headless=False)
        browser.visit(url)
        time.sleep(3)
        print("Open web browser")
        tables = pd.read_html(url)
        time.sleep(3)
        table_temp = tables[0]
        print("Read and save table")
        browser.quit()
        page_num += 200
        table_mojo_test_df = table_mojo_test_df.append(table_temp)
        print('-------------------------------------')

Printing first 200 rows.
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW
Open web browser
Read and save table
-------------------------------------
Printing pages 201 to 400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=200
Open web browser
Read and save table
-------------------------------------
Printing pages 401 to 600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=400
Open web browser
Read and save table
-------------------------------------
Printing pages 601 to 800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=600
Open web browser
Read and save table
-------------------------------------
Printing pages 801 to 1000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=800
Open web browser
Read and save table
-------------------------------------
Printing pages 1001 to 1200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1000
Open web browser
Read and save table
-------------------------------------
Printing pages 1201 to 1400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1200
Open web browser
Read and save table
-------------------------------------
Printing pages 1401 to 1600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1400
Open web browser
Read and save table
-------------------------------------
Printing pages 1601 to 1800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1600
Open web browser
Read and save table
-------------------------------------
Printing pages 1801 to 2000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=1800
Open web browser
Read and save table
-------------------------------------
Printing pages 2001 to 2200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2000
Open web browser
Read and save table
-------------------------------------
Printing pages 2201 to 2400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2200
Open web browser
Read and save table
-------------------------------------
Printing pages 2401 to 2600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2400
Open web browser
Read and save table
-------------------------------------
Printing pages 2601 to 2800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2600
Open web browser
Read and save table
-------------------------------------
Printing pages 2801 to 3000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=2800
Open web browser
Read and save table
-------------------------------------
Printing pages 3001 to 3200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3000
Open web browser
Read and save table
-------------------------------------
Printing pages 3201 to 3400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3200
Open web browser
Read and save table
-------------------------------------
Printing pages 3401 to 3600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3400
Open web browser
Read and save table
-------------------------------------
Printing pages 3601 to 3800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3600
Open web browser
Read and save table
-------------------------------------
Printing pages 3801 to 4000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=3800
Open web browser
Read and save table
-------------------------------------
Printing pages 4001 to 4200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4000
Open web browser
Read and save table
-------------------------------------
Printing pages 4201 to 4400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4200
Open web browser
Read and save table
-------------------------------------
Printing pages 4401 to 4600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4400
Open web browser
Read and save table
-------------------------------------
Printing pages 4601 to 4800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4600
Open web browser
Read and save table
-------------------------------------
Printing pages 4801 to 5000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=4800
Open web browser
Read and save table
-------------------------------------
Printing pages 5001 to 5200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5000
Open web browser
Read and save table
-------------------------------------
Printing pages 5201 to 5400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5200
Open web browser
Read and save table
-------------------------------------
Printing pages 5401 to 5600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5400
Open web browser
Read and save table
-------------------------------------
Printing pages 5601 to 5800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5600
Open web browser
Read and save table
-------------------------------------
Printing pages 5801 to 6000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=5800
Open web browser
Read and save table
-------------------------------------
Printing pages 6001 to 6200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6000
Open web browser
Read and save table
-------------------------------------
Printing pages 6201 to 6400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6200
Open web browser
Read and save table
-------------------------------------
Printing pages 6401 to 6600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6400
Open web browser
Read and save table
-------------------------------------
Printing pages 6601 to 6800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6600
Open web browser
Read and save table
-------------------------------------
Printing pages 6801 to 7000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=6800
Open web browser
Read and save table
-------------------------------------
Printing pages 7001 to 7200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7000
Open web browser
Read and save table
-------------------------------------
Printing pages 7201 to 7400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7200
Open web browser
Read and save table
-------------------------------------
Printing pages 7401 to 7600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7400
Open web browser
Read and save table
-------------------------------------
Printing pages 7601 to 7800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7600
Open web browser
Read and save table
-------------------------------------
Printing pages 7801 to 8000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=7800
Open web browser
Read and save table
-------------------------------------
Printing pages 8001 to 8200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8000
Open web browser
Read and save table
-------------------------------------
Printing pages 8201 to 8400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8200
Open web browser
Read and save table
-------------------------------------
Printing pages 8401 to 8600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8400
Open web browser
Read and save table
-------------------------------------
Printing pages 8601 to 8800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8600
Open web browser
Read and save table
-------------------------------------
Printing pages 8801 to 9000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=8800
Open web browser
Read and save table
-------------------------------------
Printing pages 9001 to 9200
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9000
Open web browser

Read and save table
-------------------------------------
Printing pages 9201 to 9400
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9200
Open web browser
Read and save table
-------------------------------------
Printing pages 9401 to 9600
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9400
Open web browser
Read and save table
-------------------------------------
Printing pages 9601 to 9800
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9600
Open web browser
Read and save table
-------------------------------------
Printing pages 9801 to 10000
https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW&offset=9800
Open web browser
Read and save table
-------------------------------------

In [5]:
# Save to the csv file
table_mojo_test_df.to_csv("csv_files/Dataset1_Mojo_total_gross_revenue.csv")

In [6]:
table_mojo_test_df.tail(20)

,Rank,Title,Lifetime Gross,Year
180,9981,Inchon,"$5,200,986",1982
181,9982,Jane Eyre,"$5,200,601",1996
182,9983,Kelly's Heroes,"$5,200,000",1970
183,9984,Death Bell 2: Bloody Camp,"$5,198,289",2010
184,9985,L'antidote,"$5,194,913",2005
185,9986,Clara's Heart,"$5,194,491",1988
186,9987,Schuks Tshabalala's Survival Guide to South Af...,"$5,194,418",2010
187,9988,Min søsters børn i Afrika,"$5,194,312",2013
188,9989,Zindagi Na Milegi Dobara,"$5,192,743",2011
189,9990,Yoko,"$5,191,840",2012
190,9991,Nous York,"$5,189,055",2012
191,9992,Sapphire Blue,"$5,188,128",2014
192,9993,Oldboy,"$5,186,767",2013
193,9994,52 Pick-Up,"$5,186,646",1986
194,9995,Little Big Soldier,"$5,186,427",2010
195,9996,Bank Error in Your Favour,"$5,186,282",2009
196,9997,Sales gosses,"$5,184,002",2017
197,9998,Vampire Sisters 2: Bats in the Belly,"$5,182,195",2014
198,9999,Born in the Exile: Sandaime J Soul Brothers no...,"$5,181,032",2016
199,10000,All-Round Appraiser Q: The Eyes of Mona Lisa,"$5,180,116",2014

# Prepare total gross revenue data set

In [4]:
# Read the clean, combined csv file
master_df = pd.read_csv("csv_files/Dataset1_Mojo_total_gross_revenue.csv")

In [5]:
# Getting the duplicate movie by title and year released. 
duplicated_master_df = master_df.loc[master_df.duplicated(subset=["Title","Year"]), "Title"].unique()
duplicated_master_df

array(['War of the Buttons', 'My Love'], dtype=object)

In [6]:
# Get all the data for the duplicate movie 
duplicated_master_df = master_df.loc[master_df["Title"] == "War of the Buttons"]
duplicated_master_df

      Unnamed: 0  Rank               Title Lifetime Gross  Year
5984         184  5985  War of the Buttons    $15,082,409  2011
6646          46  6647  War of the Buttons    $12,326,773  2011

In [7]:
# Get all the data for the duplicate movie 
duplicated_master_df = master_df.loc[master_df["Title"] == "My Love"]
duplicated_master_df

      Unnamed: 0  Rank    Title Lifetime Gross  Year
5335         135  5336  My Love    $18,525,631  2007
8996         196  8997  My Love     $6,660,413  2007

In [8]:
# reset index
master_df.reset_index()

,index,Unnamed: 0,Rank,Title,Lifetime Gross,Year
0,0,0,1,Avengers: Endgame,"$2,797,800,564",2019
1,1,1,2,Avatar,"$2,790,439,000",2009
2,2,2,3,Titanic,"$2,195,169,138",1997
3,3,3,4,Star Wars: Episode VII - The Force Awakens,"$2,068,223,624",2015
4,4,4,5,Avengers: Infinity War,"$2,048,359,754",2018
...,...,...,...,...,...,...
9995,9995,195,9996,Bank Error in Your Favour,"$5,186,282",2009
9996,9996,196,9997,Sales gosses,"$5,184,002",2017
9997,9997,197,9998,Vampire Sisters 2: Bats in the Belly,"$5,182,195",2014
9998,9998,198,9999,Born in the Exile: Sandaime J Soul Brothers no...,"$5,181,032",2016
9999,9999,199,10000,All-Round Appraiser Q: The Eyes of Mona Lisa,"$5,180,116",2014

In [9]:
# Drop row by index. Note: this index might change in if original data changes
total_gross_info = master_df.drop(index=master_df.index[[6646, 8996]])
# See index from above

In [10]:
len(total_gross_info)

9998

In [11]:
# Select columns
total_gross_info = total_gross_info[['Rank', 'Title', 'Year', 'Lifetime Gross']]

In [12]:
# Rename columns
total_gross_info = total_gross_info.rename(columns={'Rank': 'rank', 'Title': 'name', 
                'Year': 'year', 'GrossNumeric': 'total_revenue_usd'})

In [13]:
total_gross_info.head()

   rank                                        name  year  Lifetime Gross
0     1                           Avengers: Endgame  2019  $2,797,800,564
1     2                                      Avatar  2009  $2,790,439,000
2     3                                     Titanic  1997  $2,195,169,138
3     4  Star Wars: Episode VII - The Force Awakens  2015  $2,068,223,624
4     5                      Avengers: Infinity War  2018  $2,048,359,754

In [14]:
# Change name column to lower case to easier join 
total_gross_info['name'] = total_gross_info['name'].str.capitalize()

In [15]:
# Drop year column
total_gross_info = total_gross_info.drop(columns='year')

In [16]:
# Rename Lifetime Gross to total_revenue_usd
total_gross_info = total_gross_info.rename(columns={'Lifetime Gross': 'total_revenue_usd'})

In [17]:
total_gross_info.head()

   rank                                        name total_revenue_usd
0     1                           Avengers: endgame    $2,797,800,564
1     2                                      Avatar    $2,790,439,000
2     3                                     Titanic    $2,195,169,138
3     4  Star wars: episode vii - the force awakens    $2,068,223,624
4     5                      Avengers: infinity war    $2,048,359,754

In [18]:
# Convert total_revenue_usd to Integer
tot_rev_usd = total_gross_info['total_revenue_usd']
len(tot_rev_usd)

9998

In [19]:
list = []
for i in tot_rev_usd:
    list.append(i.split('$')[-1]) 
print(list[:10])

['2,797,800,564', '2,790,439,000', '2,195,169,138', '2,068,223,624', '2,048,359,754', '1,670,400,637', '1,656,943,394', '1,518,812,988', '1,515,048,151', '1,450,026,933']

In [20]:
split_list = []
for i in list:
    i = i.split(',')
    split_list.append(''.join(i))

In [21]:
merged_list = []
for i in split_list:
    merged_list.append(''.join(i)) 
print(merged_list[:5])

['2797800564', '2790439000', '2195169138', '2068223624', '2048359754']

In [22]:
len(merged_list)

9998

In [23]:
# Change revenue column from string to big integer
total_gross_info['total_revenue_usd'] = merged_list

In [24]:
total_gross_info['total_revenue_usd'] = pd.to_numeric(total_gross_info['total_revenue_usd'])

In [25]:
total_gross_info.dtypes

rank                  int64
name                 object
total_revenue_usd     int64
dtype: object

In [26]:
total_gross_info.to_csv('csv_files/Total_Gross_Info.csv')

## Dataset 2 - Kaggle domestic revenue data - Load and clean¶
#### Please download source data set - https://www.kaggle.com/danielgrijalvas/movies?select=movies.csv
#### Save in 'csv_files/datasets_2745_4700_movies.csv'

In [27]:
path = 'csv_files/datasets_2745_4700_movies.csv'

In [28]:
# Convert all rows to UTF-8 type and write to a new file
with open(path, 'r', encoding='utf-8', errors='ignore') as infile, open(path + '_UTF8.csv', 'w') as outfile:
     inputs = csv.reader(infile)
     output = csv.writer(outfile)

     for index, row in enumerate(inputs):
         # Create file with no header
         if index == 0:
             continue
         output.writerow(row)

In [29]:
# Read csv file into df
domestic_df = pd.read_csv('csv_files/datasets_2745_4700_movies.csv_UTF8.csv')

In [30]:
# Add header 
domestic_df.columns = ["budget","company","country","director","genre","gross","name","rating","released","runtime","score","star","votes","writer","year"]

In [31]:
domestic_df.head(2)

,budget,company,country,director,genre,gross,name,rating,released,runtime,score,star,votes,writer,year
0,6000000,Paramount Pictures,USA,John Hughes,Comedy,70136369,Ferris Bueller's Day Off,PG-13,6/11/86,103,7.8,Matthew Broderick,264740,John Hughes,1986
1,15000000,Paramount Pictures,USA,Tony Scott,Action,179800601,Top Gun,PG,5/16/86,110,6.9,Tom Cruise,236909,Jim Cash,1986

In [32]:
# Make names capitalized
domestic_df['name'] = domestic_df['name'].str.capitalize()

In [33]:
domestic_df.head(2)

,budget,company,country,director,genre,gross,name,rating,released,runtime,score,star,votes,writer,year
0,6000000,Paramount Pictures,USA,John Hughes,Comedy,70136369,Ferris bueller's day off,PG-13,6/11/86,103,7.8,Matthew Broderick,264740,John Hughes,1986
1,15000000,Paramount Pictures,USA,Tony Scott,Action,179800601,Top gun,PG,5/16/86,110,6.9,Tom Cruise,236909,Jim Cash,1986

In [34]:
# Getting the duplicate movies
duplicated_domestic_df = domestic_df.loc[domestic_df.duplicated(subset=["name","director"]), "name"].unique()
duplicated_domestic_df

array([], dtype=object)

In [35]:
# Getting the duplicate movie by title and star released. 
duplicated_domestic_df = domestic_df.loc[domestic_df.duplicated(subset=["name","star"]), "name"].unique()
duplicated_domestic_df

array([], dtype=object)

In [36]:
# Getting the duplicate movie by title and country released. 
duplicated_domestic_df = domestic_df.loc[domestic_df.duplicated(subset=["name","country"]), "name"].unique()
duplicated_domestic_df

array(['Dream lover', "Nobody's fool", 'Heat', 'It takes two',
       'Rumpelstiltskin', 'Bulletproof', 'Gladiator',
       'Where the heart is', 'Hamlet', 'The in crowd',
       'Behind enemy lines', 'Out cold', 'Bad company', 'Crossroads',
       'The rookie', 'The hunted', 'It runs in the family',
       'Man of the house', 'The guardian', 'Pulse', 'Hairspray',
       'The hitcher', 'Twilight', 'The unborn', 'Fair game',
       'Death at a funeral', 'Morning glory', 'Trespass', 'The avengers',
       'Les misrables', 'Project x', 'Playing for keeps', 'Promised land',
       'Frozen', 'Hercules', 'Godzilla', 'Robocop',
       'Teenage mutant ninja turtles', 'The gift', 'Fantastic four',
       'No escape', 'Hot pursuit', 'Sing', 'Passengers', 'Masterminds'],
      dtype=object)

In [37]:
# Check duplicated movie
duplicated_domestic_df = domestic_df.loc[domestic_df["name"] == "Godzilla"]
duplicated_domestic_df

,budget,company,country,director,genre,gross,name,rating,released,runtime,score,star,votes,writer,year
2683,130000000,Centropolis Film Productions,USA,Roland Emmerich,Action,136314294,Godzilla,PG-13,5/20/98,139,5.3,Matthew Broderick,160038,Dean Devlin,1998
6207,160000000,Warner Bros.,USA,Gareth Edwards,Action,200676069,Godzilla,PG-13,5/16/14,123,6.4,Aaron Taylor-Johnson,323734,Max Borenstein,2014

In [38]:
# Rename gross to domestic_revenue_usd
domestic_gross_info = domestic_df.rename(columns={'gross': 'domestic_revenue_usd'})

In [39]:
# Rename released to release_date
domestic_gross_info = domestic_gross_info.rename(columns={'released': 'release_date'})

In [40]:
# Drop columns we do not need ('budget', 'runtime', 'score', 'votes', 'year')
domestic_gross_info = domestic_gross_info.drop(columns=['budget', 'runtime', 'score', 'votes'])

In [41]:
domestic_gross_info.head(2)

,company,country,director,genre,domestic_revenue_usd,name,rating,release_date,star,writer,year
0,Paramount Pictures,USA,John Hughes,Comedy,70136369,Ferris bueller's day off,PG-13,6/11/86,Matthew Broderick,John Hughes,1986
1,Paramount Pictures,USA,Tony Scott,Action,179800601,Top gun,PG,5/16/86,Tom Cruise,Jim Cash,1986

In [42]:
domestic_gross_info.dtypes

company                 object
country                 object
director                object
genre                   object
domestic_revenue_usd     int64
name                    object
rating                  object
release_date            object
star                    object
writer                  object
year                     int64
dtype: object

In [43]:
# Change release_date to datetime type
domestic_gross_info['release_date'] = pd.to_datetime(domestic_gross_info['release_date'])

In [44]:
domestic_gross_info.dtypes

company                         object
country                         object
director                        object
genre                           object
domestic_revenue_usd             int64
name                            object
rating                          object
release_date            datetime64[ns]
star                            object
writer                          object
year                             int64
dtype: object

In [45]:
# Write to csv file
domestic_gross_info.to_csv('csv_files/Domestic_Gross_Info.csv')

In [46]:
# TO THIS POINT, WE HAVE CREATED TWO MASTER DATAFRAMES THAT ARE CLEAN:
# (1) Total_Gross_Info.csv
# (2) Domestic_Gross_Info.csv

### Merge total_gross_info and domestic_gross_info tables on 'name' column

In [47]:
# combine total and domestic tables on left using name of the movie column
combined_gross_info = pd.merge(domestic_gross_info, total_gross_info, how='left', on="name")

In [48]:
combined_gross_info.head()

,company,country,director,genre,domestic_revenue_usd,name,rating,release_date,star,writer,year,rank,total_revenue_usd
0,Paramount Pictures,USA,John Hughes,Comedy,70136369,Ferris bueller's day off,PG-13,1986-06-11,Matthew Broderick,John Hughes,1986,2205.0,70712677.0
1,Paramount Pictures,USA,Tony Scott,Action,179800601,Top gun,PG,1986-05-16,Tom Cruise,Jim Cash,1986,375.0,356830601.0
2,Twentieth Century Fox Film Corporation,USA,James Cameron,Action,85160248,Aliens,R,1986-07-18,Sigourney Weaver,James Cameron,1986,1278.0,131368160.0
3,Walt Disney Pictures,USA,Randal Kleiser,Adventure,18564613,Flight of the navigator,PG,1986-08-01,Joey Cramer,Mark H. Baker,1986,5328.0,18564613.0
4,Hemdale,UK,Oliver Stone,Drama,138530565,Platoon,R,1987-02-06,Charlie Sheen,Oliver Stone,1986,1220.0,138545632.0

In [49]:
len(combined_gross_info)

7040

In [50]:
# Add new column and compute the international_total_revenue
combined_gross_info['international_revenue_usd'] = \
        (combined_gross_info['total_revenue_usd'] - combined_gross_info['domestic_revenue_usd'])

In [51]:
# Rename columns
combined_gross_info = combined_gross_info.rename(columns={'star':'actor'})

In [52]:
# Getting the duplicate movie by title and star released. 
dupl_combined_df = combined_gross_info.loc[combined_gross_info.duplicated(subset=["name","director", "year"]), "name"].unique()
dupl_combined_df

array(['The hitcher', 'Running scared', 'Crossroads',
       'My little pony: the movie', 'No mercy', "Nobody's fool",
       'Robocop', 'Overboard', 'Project x', 'Assassination',
       "Child's play", 'Hairspray', 'Masquerade', 'Heartbreak hotel',
       'Chocolat', 'Pet sematary', 'Always', 'Flatliners', 'Ghost',
       'Teenage mutant ninja turtles', 'Hamlet', 'The rookie',
       'The guardian', 'Happily ever after', 'Loose cannons',
       'Beauty and the beast', 'The addams family', 'Rush', 'White fang',
       'Switch', 'Shattered', 'Paradise', 'Aladdin', 'Unforgiven',
       'Forever young', 'Hero', 'Trespass', 'Gladiator',
       'The three musketeers', 'Much ado about nothing', 'Swing kids',
       'Fearless', 'For love or money', 'Matinee', 'The lion king',
       'Little women', 'The client', 'Wolf', 'Bad girls', 'Only you',
       'No escape', 'Lassie', 'Bad boys', 'Man of the house', 'Fair game',
       'The hunted', 'Mad love', 'Eye for an eye', 'Jane eyre', 'Mother',
       'Hercules', "My best friend's wedding", 'Rocketman',
       'Nothing to lose', 'Metro', 'Buddy', 'Psycho', 'Godzilla',
       'Great expectations', 'The avengers', 'Twilight', 'Firestorm',
       'The mummy', 'Tarzan', 'Life', 'Sunshine', "Charlie's angels",
       'What women want', 'Shaft', 'The gift', 'Bait',
       'Planet of the apes', 'The one', 'Head over heels', 'Pinocchio',
       'The eye', 'Peter pan', 'Freaky friday', 'The missing',
       'The return', 'Hellboy', 'The grudge',
       'Around the world in 80 days', 'Serenity', 'The longest yard',
       'The amityville horror', 'King kong', 'The island',
       'Fantastic four', 'Hide and seek', 'Sahara', 'The fog', 'Venom',
       'The illusionist', 'The host', 'The omen', 'When a stranger calls',
       'The pink panther', 'Amazing grace', 'Black christmas',
       'The last kiss', 'Halloween', 'Death at a funeral', 'Control',
       'War', 'Passengers', 'Prom night', 'Shutter', 'One missed call',
       'Friday the 13th', 'The girl with the dragon tattoo',
       'My bloody valentine', 'Brothers', 'Halloween ii', 'Bride wars',
       'Obsessed', 'Fighting', 'Fame', 'Clash of the titans',
       'A nightmare on elm street', 'Robin hood', 'The karate kid',
       'Unstoppable', 'The way back', 'Easy money', 'The thing',
       'Conan the barbarian', 'Footloose', 'Fright night', 'Anonymous',
       'Arthur', 'The hunt', 'Total recall', 'Red dawn', 'Carrie',
       'Annie', 'Neighbors', 'Endless love', 'About last night',
       'Cinderella', 'Legend', 'Everest', 'Youth', 'Poltergeist', 'Split',
       'Jackie', 'Ghostbusters', 'The jungle book', 'Ben-hur',
       "Pete's dragon"], dtype=object)

In [53]:
# Get all the data for the duplicate movie 
dupl_df = combined_gross_info.loc[combined_gross_info["name"] == "Clash of the titans"]
dupl_df

,company,country,director,genre,domestic_revenue_usd,name,rating,release_date,actor,writer,year,rank,total_revenue_usd,international_revenue_usd
5453,Warner Bros.,USA,Louis Leterrier,Action,163214888,Clash of the titans,PG-13,2010-04-02,Sam Worthington,Travis Beacham,2010,219.0,493214993.0,330000105.0
5454,Warner Bros.,USA,Louis Leterrier,Action,163214888,Clash of the titans,PG-13,2010-04-02,Sam Worthington,Travis Beacham,2010,3234.0,41092328.0,-122122560.0

#### (removed) Use pandas to push data into database

In [54]:
# # Check existing tables
# engine.table_names()

In [55]:
# # Create domesic gross revenue table in the database
# domestic_gross_info.to_sql(name='domestic_gross_info', con=engine, if_exists='append', index=False)

In [56]:
# type(total_gross_info['name'])

In [57]:
# total_gross_info

In [58]:
# domestic_gross_info

In [59]:
# Remove the duplicates
clean_combined_df = combined_gross_info.drop_duplicates(subset=['name','director','year'], keep='first')
clean_combined_df

,company,country,director,genre,domestic_revenue_usd,name,rating,release_date,actor,writer,year,rank,total_revenue_usd,international_revenue_usd
0,Paramount Pictures,USA,John Hughes,Comedy,70136369,Ferris bueller's day off,PG-13,1986-06-11,Matthew Broderick,John Hughes,1986,2205.0,70712677.0,576308.0
1,Paramount Pictures,USA,Tony Scott,Action,179800601,Top gun,PG,1986-05-16,Tom Cruise,Jim Cash,1986,375.0,356830601.0,177030000.0
2,Twentieth Century Fox Film Corporation,USA,James Cameron,Action,85160248,Aliens,R,1986-07-18,Sigourney Weaver,James Cameron,1986,1278.0,131368160.0,46207912.0
3,Walt Disney Pictures,USA,Randal Kleiser,Adventure,18564613,Flight of the navigator,PG,1986-08-01,Joey Cramer,Mark H. Baker,1986,5328.0,18564613.0,0.0
4,Hemdale,UK,Oliver Stone,Drama,138530565,Platoon,R,1987-02-06,Charlie Sheen,Oliver Stone,1986,1220.0,138545632.0,15067.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7035,Fox Searchlight Pictures,UK,Mandie Fletcher,Comedy,4750497,Absolutely fabulous: the movie,R,2016-07-22,Jennifer Saunders,Jennifer Saunders,2016,3358.0,39219109.0,34468612.0
7036,Siempre Viva Productions,USA,Paul Duddridge,Drama,28368,Mothers and daughters,PG-13,2016-05-06,Selma Blair,Paige Cameron,2016,NaN,NaN,NaN
7037,Warner Bros. Animation,USA,Sam Liu,Animation,3775000,Batman: the killing joke,R,2016-07-25,Kevin Conroy,Brian Azzarello,2016,NaN,NaN,NaN
7038,Borderline Presents,USA,Nicolas Pesce,Drama,25981,The eyes of my mother,R,2016-12-02,Kika Magalhes,Nicolas Pesce,2016,NaN,NaN,NaN
7039,Les Productions du Trsor,France,Nicole Garcia,Drama,37757,From the land of the moon,R,2017-07-28,Marion Cotillard,Milena Agus,2016,6475.0,13025034.0,12987277.0

In [60]:
len(clean_combined_df)

6819

### Create movies table from combined table

In [61]:
# Re-arrange the columns and write into new table
movies = clean_combined_df[['name','total_revenue_usd','international_revenue_usd','domestic_revenue_usd',
                              'director','actor','writer','genre','rating','company','country','year']]

In [62]:
movies.head()

,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year
0,Ferris bueller's day off,70712677.0,576308.0,70136369,John Hughes,Matthew Broderick,John Hughes,Comedy,PG-13,Paramount Pictures,USA,1986
1,Top gun,356830601.0,177030000.0,179800601,Tony Scott,Tom Cruise,Jim Cash,Action,PG,Paramount Pictures,USA,1986
2,Aliens,131368160.0,46207912.0,85160248,James Cameron,Sigourney Weaver,James Cameron,Action,R,Twentieth Century Fox Film Corporation,USA,1986
3,Flight of the navigator,18564613.0,0.0,18564613,Randal Kleiser,Joey Cramer,Mark H. Baker,Adventure,PG,Walt Disney Pictures,USA,1986
4,Platoon,138545632.0,15067.0,138530565,Oliver Stone,Charlie Sheen,Oliver Stone,Drama,R,Hemdale,UK,1986

In [63]:
# Fill NaN values with zeroes
movies[['total_revenue_usd','international_revenue_usd','domestic_revenue_usd']] = \
    movies[['total_revenue_usd','international_revenue_usd','domestic_revenue_usd']].fillna(0)

/Users/irina/anaconda3/envs/PythonData/lib/python3.8/site-packages/pandas/core/frame.py:2963: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[k1] = value[k2]

#### Generate movie_id index

In [64]:
movies.head()

,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year
0,Ferris bueller's day off,70712677.0,576308.0,70136369,John Hughes,Matthew Broderick,John Hughes,Comedy,PG-13,Paramount Pictures,USA,1986
1,Top gun,356830601.0,177030000.0,179800601,Tony Scott,Tom Cruise,Jim Cash,Action,PG,Paramount Pictures,USA,1986
2,Aliens,131368160.0,46207912.0,85160248,James Cameron,Sigourney Weaver,James Cameron,Action,R,Twentieth Century Fox Film Corporation,USA,1986
3,Flight of the navigator,18564613.0,0.0,18564613,Randal Kleiser,Joey Cramer,Mark H. Baker,Adventure,PG,Walt Disney Pictures,USA,1986
4,Platoon,138545632.0,15067.0,138530565,Oliver Stone,Charlie Sheen,Oliver Stone,Drama,R,Hemdale,UK,1986

In [65]:
# Sort table by total revenue column
movies_sorted = movies.sort_values(by='total_revenue_usd', ascending=False)
movies_sorted.head()

,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year
5216,Avatar,2.790439e+09,2.029931e+09,760507625,James Cameron,Sam Worthington,James Cameron,Action,PG-13,Twentieth Century Fox Film Corporation,UK,2009
2489,Titanic,2.195169e+09,1.536497e+09,658672302,James Cameron,Leonardo DiCaprio,James Cameron,Drama,PG-13,Twentieth Century Fox Film Corporation,USA,1997
6595,Jurassic world,1.670401e+09,1.018130e+09,652270625,Colin Trevorrow,Chris Pratt,Rick Jaffa,Action,PG-13,Universal Pictures,USA,2015
1814,The lion king,1.656943e+09,1.344043e+09,312900000,Roger Allers,Matthew Broderick,Irene Mecchi,Animation,G,Walt Disney Pictures,USA,1994
2783,The avengers,1.518813e+09,1.495490e+09,23322832,Jeremiah S. Chechik,Ralph Fiennes,Sydney Newman,Action,PG-13,Warner Bros.,USA,1998

In [66]:
# Reset index
movies_reset_index = movies_sorted.reset_index(drop=True)
movies_reset_index.head()

,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year
0,Avatar,2.790439e+09,2.029931e+09,760507625,James Cameron,Sam Worthington,James Cameron,Action,PG-13,Twentieth Century Fox Film Corporation,UK,2009
1,Titanic,2.195169e+09,1.536497e+09,658672302,James Cameron,Leonardo DiCaprio,James Cameron,Drama,PG-13,Twentieth Century Fox Film Corporation,USA,1997
2,Jurassic world,1.670401e+09,1.018130e+09,652270625,Colin Trevorrow,Chris Pratt,Rick Jaffa,Action,PG-13,Universal Pictures,USA,2015
3,The lion king,1.656943e+09,1.344043e+09,312900000,Roger Allers,Matthew Broderick,Irene Mecchi,Animation,G,Walt Disney Pictures,USA,1994
4,The avengers,1.518813e+09,1.495490e+09,23322832,Jeremiah S. Chechik,Ralph Fiennes,Sydney Newman,Action,PG-13,Warner Bros.,USA,1998

In [67]:
# Start index from 1
movies_reset_index.index += 1

In [68]:
# Reset index
movies = movies_reset_index.reset_index()

In [69]:
movies.head()

,index,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year
0,1,Avatar,2.790439e+09,2.029931e+09,760507625,James Cameron,Sam Worthington,James Cameron,Action,PG-13,Twentieth Century Fox Film Corporation,UK,2009
1,2,Titanic,2.195169e+09,1.536497e+09,658672302,James Cameron,Leonardo DiCaprio,James Cameron,Drama,PG-13,Twentieth Century Fox Film Corporation,USA,1997
2,3,Jurassic world,1.670401e+09,1.018130e+09,652270625,Colin Trevorrow,Chris Pratt,Rick Jaffa,Action,PG-13,Universal Pictures,USA,2015
3,4,The lion king,1.656943e+09,1.344043e+09,312900000,Roger Allers,Matthew Broderick,Irene Mecchi,Animation,G,Walt Disney Pictures,USA,1994
4,5,The avengers,1.518813e+09,1.495490e+09,23322832,Jeremiah S. Chechik,Ralph Fiennes,Sydney Newman,Action,PG-13,Warner Bros.,USA,1998

In [70]:
movies = movies.rename(columns={'index': 'movie_id'})

In [71]:
movies.head()

,movie_id,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year
0,1,Avatar,2.790439e+09,2.029931e+09,760507625,James Cameron,Sam Worthington,James Cameron,Action,PG-13,Twentieth Century Fox Film Corporation,UK,2009
1,2,Titanic,2.195169e+09,1.536497e+09,658672302,James Cameron,Leonardo DiCaprio,James Cameron,Drama,PG-13,Twentieth Century Fox Film Corporation,USA,1997
2,3,Jurassic world,1.670401e+09,1.018130e+09,652270625,Colin Trevorrow,Chris Pratt,Rick Jaffa,Action,PG-13,Universal Pictures,USA,2015
3,4,The lion king,1.656943e+09,1.344043e+09,312900000,Roger Allers,Matthew Broderick,Irene Mecchi,Animation,G,Walt Disney Pictures,USA,1994
4,5,The avengers,1.518813e+09,1.495490e+09,23322832,Jeremiah S. Chechik,Ralph Fiennes,Sydney Newman,Action,PG-13,Warner Bros.,USA,1998

In [72]:
# Reset index
movies.reset_index()

,index,movie_id,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year
0,0,1,Avatar,2.790439e+09,2.029931e+09,760507625,James Cameron,Sam Worthington,James Cameron,Action,PG-13,Twentieth Century Fox Film Corporation,UK,2009
1,1,2,Titanic,2.195169e+09,1.536497e+09,658672302,James Cameron,Leonardo DiCaprio,James Cameron,Drama,PG-13,Twentieth Century Fox Film Corporation,USA,1997
2,2,3,Jurassic world,1.670401e+09,1.018130e+09,652270625,Colin Trevorrow,Chris Pratt,Rick Jaffa,Action,PG-13,Universal Pictures,USA,2015
3,3,4,The lion king,1.656943e+09,1.344043e+09,312900000,Roger Allers,Matthew Broderick,Irene Mecchi,Animation,G,Walt Disney Pictures,USA,1994
4,4,5,The avengers,1.518813e+09,1.495490e+09,23322832,Jeremiah S. Chechik,Ralph Fiennes,Sydney Newman,Action,PG-13,Warner Bros.,USA,1998
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6814,6814,6815,Timber falls,0.000000e+00,0.000000e+00,50000,Tony Giglio,Josh Randall,Dan Kay,Horror,R,Rifkin-Eberts,USA,2007
6815,6815,6816,The last days of disco,0.000000e+00,0.000000e+00,2987297,Whit Stillman,Chlo Sevigny,Whit Stillman,Comedy,R,Castle Rock Entertainment,USA,1998
6816,6816,6817,High art,0.000000e+00,0.000000e+00,1929168,Lisa Cholodenko,Radha Mitchell,Lisa Cholodenko,Drama,R,391 Productions,USA,1998
6817,6817,6818,Battle in seattle,0.000000e+00,0.000000e+00,223537,Stuart Townsend,Andr Benjamin,Stuart Townsend,Action,R,Hyde Park Entertainment,Canada,2007
6818,6818,6819,3 men and a little lady,0.000000e+00,0.000000e+00,71609321,Emile Ardolino,Tom Selleck,Coline Serreau,Comedy,PG,Touchstone Pictures,USA,1990

In [73]:
movies.head()

,movie_id,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year
0,1,Avatar,2.790439e+09,2.029931e+09,760507625,James Cameron,Sam Worthington,James Cameron,Action,PG-13,Twentieth Century Fox Film Corporation,UK,2009
1,2,Titanic,2.195169e+09,1.536497e+09,658672302,James Cameron,Leonardo DiCaprio,James Cameron,Drama,PG-13,Twentieth Century Fox Film Corporation,USA,1997
2,3,Jurassic world,1.670401e+09,1.018130e+09,652270625,Colin Trevorrow,Chris Pratt,Rick Jaffa,Action,PG-13,Universal Pictures,USA,2015
3,4,The lion king,1.656943e+09,1.344043e+09,312900000,Roger Allers,Matthew Broderick,Irene Mecchi,Animation,G,Walt Disney Pictures,USA,1994
4,5,The avengers,1.518813e+09,1.495490e+09,23322832,Jeremiah S. Chechik,Ralph Fiennes,Sydney Newman,Action,PG-13,Warner Bros.,USA,1998

### Extract Actor data into a separate table

In [74]:
# Save star_actor data into a separate table
actor = movies['actor'].unique()
len(actor)

2504

In [75]:
actor[:5]

array(['Sam Worthington', 'Leonardo DiCaprio', 'Chris Pratt',
       'Matthew Broderick', 'Ralph Fiennes'], dtype=object)

In [76]:
actor = pd.DataFrame({'actor': actor})
actor.head(2)

               actor
0    Sam Worthington
1  Leonardo DiCaprio

In [77]:
actor.index += 1
actor

                  actor
1       Sam Worthington
2     Leonardo DiCaprio
3           Chris Pratt
4     Matthew Broderick
5         Ralph Fiennes
...                 ...
2500         Hideaki It
2501          Teri Garr
2502      Summer Bishil
2503       Josh Randall
2504       Chlo Sevigny

[2504 rows x 1 columns]

In [78]:
actor = actor.reset_index()
actor.head(2)

   index              actor
0      1    Sam Worthington
1      2  Leonardo DiCaprio

In [79]:
actor = actor.rename(columns={'index': 'actor_id'})
actor.head()

   actor_id              actor
0         1    Sam Worthington
1         2  Leonardo DiCaprio
2         3        Chris Pratt
3         4  Matthew Broderick
4         5      Ralph Fiennes

In [80]:
len(actor)

2504

### Merge movie and actor df on actor column

In [81]:
# combine movie and tables
movie_actor = pd.merge(movies, actor, how='outer', on="actor")

In [82]:
# Extract only movie_id and actor_id columns
movie_actor = movie_actor[['movie_id', 'actor_id']]
movie_actor

      movie_id  actor_id
0            1         1
1          164         1
2         2059         1
3         4479         1
4         4837         1
...        ...       ...
6814      6803      2500
6815      6804      2501
6816      6809      2502
6817      6815      2503
6818      6816      2504

[6819 rows x 2 columns]

In [83]:
# Save to csv
movie_actor.to_csv('csv_files/movie_actor.csv')

### Create director_movie table

In [84]:
# Save star_actor data into a separate table
director = movies['director'].unique()
len(director)

2759

In [85]:
director[:5]

array(['James Cameron', 'Colin Trevorrow', 'Roger Allers',
       'Jeremiah S. Chechik', 'Joss Whedon'], dtype=object)

In [86]:
director = pd.DataFrame({'director': director})
director.head(2)

          director
0    James Cameron
1  Colin Trevorrow

In [87]:
director.index += 1
director

                 director
1           James Cameron
2         Colin Trevorrow
3            Roger Allers
4     Jeremiah S. Chechik
5             Joss Whedon
...                   ...
2755          Luca Puenzo
2756            Alan Ball
2757    Deborah Kampmeier
2758          Tony Giglio
2759      Stuart Townsend

[2759 rows x 1 columns]

In [88]:
director = director.reset_index()
director.head(2)

   index         director
0      1    James Cameron
1      2  Colin Trevorrow

In [89]:
director = director.rename(columns={'index': 'director_id'})
director.head()

   director_id             director
0            1        James Cameron
1            2      Colin Trevorrow
2            3         Roger Allers
3            4  Jeremiah S. Chechik
4            5          Joss Whedon

In [90]:
len(director)

2759

### Merge movie and director df on actor column

In [91]:
# combine movie and tables
movie_director = pd.merge(movies, director, how='outer', on="director")

In [92]:
# Extract only movie_id and actor_id columns
movie_director = movie_director[['movie_id', 'director_id']]
movie_director

      movie_id  director_id
0            1            1
1            2            1
2          155            1
3          244            1
4          988            1
...        ...          ...
6814      6808         2755
6815      6809         2756
6816      6813         2757
6817      6815         2758
6818      6818         2759

[6819 rows x 2 columns]

In [93]:
# Save to csv
movie_director.to_csv('csv_files/movie_director.csv')

### Create company_movie table

In [94]:
# Save company_movie data into a separate table
company = movies['company'].unique()
len(company)

2179

In [95]:
company[:5]

array(['Twentieth Century Fox Film Corporation', 'Universal Pictures',
       'Walt Disney Pictures', 'Warner Bros.', 'Marvel Studios'],
      dtype=object)

In [96]:
company = pd.DataFrame({'company': company})
company.head(2)

                                  company
0  Twentieth Century Fox Film Corporation
1                      Universal Pictures

In [97]:
company.index += 1
company

                                     company
1     Twentieth Century Fox Film Corporation
2                         Universal Pictures
3                       Walt Disney Pictures
4                               Warner Bros.
5                             Marvel Studios
...                                      ...
2175                             Cinema Plus
2176                 Enchanter Entertainment
2177    Historias Cinematograficas Cinemania
2178                           Cuba Pictures
2179                           Deerjen Films

[2179 rows x 1 columns]

In [98]:
company = company.reset_index()
company.head(2)

   index                                 company
0      1  Twentieth Century Fox Film Corporation
1      2                      Universal Pictures

In [99]:
company = company.rename(columns={'index': 'company_id'})
company.head()

   company_id                                 company
0           1  Twentieth Century Fox Film Corporation
1           2                      Universal Pictures
2           3                    Walt Disney Pictures
3           4                            Warner Bros.
4           5                          Marvel Studios

In [100]:
len(company)

2179

### Merge movie and company df on actor column

In [101]:
# combine movie and tables
company_movie = pd.merge(movies, company, how='outer', on="company")

In [102]:
# Extract only movie_id and actor_id columns
company_movie = company_movie[['movie_id', 'company_id']]
company_movie

      movie_id  company_id
0            1           1
1            2           1
2           60           1
3           68           1
4           77           1
...        ...         ...
6814      6804        2175
6815      6805        2176
6816      6808        2177
6817      6812        2178
6818      6813        2179

[6819 rows x 2 columns]

In [103]:
# Save to csv
company_movie.to_csv('csv_files/company_movie.csv')

## Extract Writer data into a separate table

In [104]:
# Save writer data into a separate table
writer = movies['writer'].unique()
len(writer)

4199

In [105]:
writer[:5]

array(['James Cameron', 'Rick Jaffa', 'Irene Mecchi', 'Sydney Newman',
       'Joss Whedon'], dtype=object)

In [106]:
writer = pd.DataFrame({'writer': writer})
writer.head(2)

          writer
0  James Cameron
1     Rick Jaffa

In [107]:
writer.index += 1
writer

                 writer
1         James Cameron
2            Rick Jaffa
3          Irene Mecchi
4         Sydney Newman
5           Joss Whedon
...                 ...
4195   Jonathan Trigell
4196  Deborah Kampmeier
4197     Dylan Haggerty
4198            Dan Kay
4199    Stuart Townsend

[4199 rows x 1 columns]

In [108]:
writer = writer.reset_index()
writer.head(2)

   index         writer
0      1  James Cameron
1      2     Rick Jaffa

In [109]:
writer = writer.rename(columns={'index': 'writer_id'})
writer.head()

   writer_id         writer
0          1  James Cameron
1          2     Rick Jaffa
2          3   Irene Mecchi
3          4  Sydney Newman
4          5    Joss Whedon

In [110]:
len(writer)

4199

### Merge writer_id column to movies table

In [111]:
# combine movie and tables
movies = pd.merge(movies, writer, how='outer', on="writer")

In [112]:
movies.head()

,movie_id,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year,writer_id
0,1,Avatar,2.790439e+09,2.029931e+09,760507625,James Cameron,Sam Worthington,James Cameron,Action,PG-13,Twentieth Century Fox Film Corporation,UK,2009,1
1,2,Titanic,2.195169e+09,1.536497e+09,658672302,James Cameron,Leonardo DiCaprio,James Cameron,Drama,PG-13,Twentieth Century Fox Film Corporation,USA,1997,1
2,155,Terminator 2: judgment day,5.208848e+08,3.160415e+08,204843350,James Cameron,Arnold Schwarzenegger,James Cameron,Action,R,Carolco Pictures,USA,1991,1
3,204,Terminator 3: rise of the machines,4.333711e+08,2.830000e+08,150371112,Jonathan Mostow,Arnold Schwarzenegger,James Cameron,Action,R,C-2 Pictures,USA,2003,1
4,988,Aliens,1.313682e+08,4.620791e+07,85160248,James Cameron,Sigourney Weaver,James Cameron,Action,R,Twentieth Century Fox Film Corporation,USA,1986,1

## Extract Genre data into a separate table

In [113]:
# Save genre data into a separate table
genre = movies['genre'].unique()
len(genre)

17

In [114]:
genre[:5]

array(['Action', 'Drama', 'Adventure', 'Animation', 'Horror'],
      dtype=object)

In [115]:
genre = pd.DataFrame({'genre': genre})
genre.head(2)

    genre
0  Action
1   Drama

In [116]:
genre.index += 1
genre

        genre
1      Action
2       Drama
3   Adventure
4   Animation
5      Horror
6      Comedy
7    Thriller
8       Crime
9   Biography
10    Romance
11    Mystery
12     Sci-Fi
13    Fantasy
14     Family
15        War
16    Western
17    Musical

In [117]:
genre = genre.reset_index()
genre.head(2)

   index   genre
0      1  Action
1      2   Drama

In [118]:
genre = genre.rename(columns={'index': 'genre_id'})
genre.head()

   genre_id      genre
0         1     Action
1         2      Drama
2         3  Adventure
3         4  Animation
4         5     Horror

In [119]:
len(genre)

17

### Merge genre_id column to movies table

In [120]:
# combine movies and genre
movies = pd.merge(movies, genre, how='outer', on="genre")

In [121]:
movies.head()

,movie_id,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year,writer_id,genre_id
0,1,Avatar,2.790439e+09,2.029931e+09,760507625,James Cameron,Sam Worthington,James Cameron,Action,PG-13,Twentieth Century Fox Film Corporation,UK,2009,1,1
1,155,Terminator 2: judgment day,5.208848e+08,3.160415e+08,204843350,James Cameron,Arnold Schwarzenegger,James Cameron,Action,R,Carolco Pictures,USA,1991,1,1
2,204,Terminator 3: rise of the machines,4.333711e+08,2.830000e+08,150371112,Jonathan Mostow,Arnold Schwarzenegger,James Cameron,Action,R,C-2 Pictures,USA,2003,1,1
3,988,Aliens,1.313682e+08,4.620791e+07,85160248,James Cameron,Sigourney Weaver,James Cameron,Action,R,Twentieth Century Fox Film Corporation,USA,1986,1,1
4,4113,Strange days,7.959291e+06,4.029100e+04,7919000,Kathryn Bigelow,Ralph Fiennes,James Cameron,Action,R,Lightstorm Entertainment,USA,1995,1,1

In [122]:
movies.to_csv('csv_files/movies_genre_ids.csv')

## Extract rating data into a separate table

In [123]:
# Save rating data into a separate table
rating = movies['rating'].unique()
len(rating)

13

In [124]:
rating[:5]

array(['PG-13', 'R', 'PG', 'NOT RATED', 'UNRATED'], dtype=object)

In [125]:
rating = pd.DataFrame({'rating': rating})
rating.head(2)

  rating
0  PG-13
1      R

In [126]:
rating.index += 1

In [127]:
rating = rating.reset_index()
rating.head(2)

   index rating
0      1  PG-13
1      2      R

In [128]:
rating = rating.rename(columns={'index': 'rating_id'})
rating.head()

   rating_id     rating
0          1      PG-13
1          2          R
2          3         PG
3          4  NOT RATED
4          5    UNRATED

In [129]:
len(rating)

13

### Merge rating_id column to movies table

In [130]:
# combine movies and rating
movies = pd.merge(movies, rating, how='outer', on="rating")

In [131]:
movies.head()

,movie_id,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year,writer_id,genre_id,rating_id
0,1,Avatar,2.790439e+09,2.029931e+09,760507625,James Cameron,Sam Worthington,James Cameron,Action,PG-13,Twentieth Century Fox Film Corporation,UK,2009,1,1,1
1,3,Jurassic world,1.670401e+09,1.018130e+09,652270625,Colin Trevorrow,Chris Pratt,Rick Jaffa,Action,PG-13,Universal Pictures,USA,2015,2,1,1
2,173,Rise of the planet of the apes,4.818009e+08,3.050407e+08,176760185,Rupert Wyatt,James Franco,Rick Jaffa,Action,PG-13,Twentieth Century Fox Film Corporation,USA,2011,2,1,1
3,5,The avengers,1.518813e+09,1.495490e+09,23322832,Jeremiah S. Chechik,Ralph Fiennes,Sydney Newman,Action,PG-13,Warner Bros.,USA,1998,4,1,1
4,6,The avengers,1.518813e+09,8.954551e+08,623357910,Joss Whedon,Robert Downey Jr.,Joss Whedon,Action,PG-13,Marvel Studios,USA,2012,5,1,1

In [132]:
movies.to_csv('csv_files/movies_rating_ids.csv')

# Remove unnecessary columns from movies

In [133]:
movies.head(2)

,movie_id,name,total_revenue_usd,international_revenue_usd,domestic_revenue_usd,director,actor,writer,genre,rating,company,country,year,writer_id,genre_id,rating_id
0,1,Avatar,2.790439e+09,2.029931e+09,760507625,James Cameron,Sam Worthington,James Cameron,Action,PG-13,Twentieth Century Fox Film Corporation,UK,2009,1,1,1
1,3,Jurassic world,1.670401e+09,1.018130e+09,652270625,Colin Trevorrow,Chris Pratt,Rick Jaffa,Action,PG-13,Universal Pictures,USA,2015,2,1,1

In [134]:
movies = movies[['movie_id','country','genre_id','writer_id','rating_id','name','year','domestic_revenue_usd',
                 'international_revenue_usd', 'total_revenue_usd']]

In [135]:
movies.head()

,movie_id,country,genre_id,writer_id,rating_id,name,year,domestic_revenue_usd,international_revenue_usd,total_revenue_usd
0,1,UK,1,1,1,Avatar,2009,760507625,2.029931e+09,2.790439e+09
1,3,USA,1,2,1,Jurassic world,2015,652270625,1.018130e+09,1.670401e+09
2,173,USA,1,2,1,Rise of the planet of the apes,2011,176760185,3.050407e+08,4.818009e+08
3,5,USA,1,4,1,The avengers,1998,23322832,1.495490e+09,1.518813e+09
4,6,USA,1,5,1,The avengers,2012,623357910,8.954551e+08,1.518813e+09

## Push table to PostgreSQL

### !!! Please import QuickDBD-export.sql in the repo root folder file in pgAdmin
### !!! Run SQL file to generate the tables and reference links
### UNCOMMENT cell below to run the rest of the code

In [138]:
# # Connect to the local database
# connection_string = f'{username}:{password}@localhost:5432/movies_db'
# engine = create_engine(f'postgresql://{connection_string}')

In [139]:
genre.to_sql(name='genre', con=engine, if_exists='append', index=False)

In [140]:
writer.to_sql(name='writer', con=engine, if_exists='append', index=False)

In [141]:
director.to_sql(name='director', con=engine, if_exists='append', index=False)

In [142]:
rating.to_sql(name='rating', con=engine, if_exists='append', index=False)

In [143]:
company.to_sql(name='company', con=engine, if_exists='append', index=False)

In [144]:
actor.to_sql(name='actor', con=engine, if_exists='append', index=False)

In [145]:
movies.to_sql(name='movies', con=engine, if_exists='append', index=False)

In [146]:
company_movie.to_sql(name='company_movie', con=engine, if_exists='append', index=False)

In [147]:
movie_actor.to_sql(name='movie_actor', con=engine, if_exists='append', index=False)

In [148]:
movie_director.to_sql(name='movie_director', con=engine, if_exists='append', index=False)